In [5]:
import numpy as np
import pandas as pd

lst0=[0,1,2, 3] #表示df的一行
lst1 = [10, 11, 12, 13]
lst2 = [20, 21, 22, 23]
lst3 = [30, 31, 32, 33]
lst4 = [40, 41, 42, 43]
lst5 = [50, 51, 52, 53]

ds=pd.DataFrame(data=[lst0, lst1, lst2, lst3, lst4, lst5], columns=['col1','col2','col3', 'col4']) #从列表生成DF
ds

   col1  col2  col3  col4
0     0     1     2     3
1    10    11    12    13
2    20    21    22    23
3    30    31    32    33
4    40    41    42    43
5    50    51    52    53

In [8]:
ds['col2'][5]

51

In [9]:
df = ds

In [12]:
a = df.loc[5]
a

col1    50
col2    51
col3    52
col4    53
Name: 5, dtype: int64

In [13]:
type(a)

pandas.core.series.Series

In [14]:
a[0]

50

In [16]:
df

   col1  col2  col3  col4
0     0     1     2     3
1    10    11    12    13
2    20    21    22    23
3    30    31    32    33
4    40    41    42    43
5    50    51    52    53

In [21]:
a =  df.index.values

In [22]:
type(a)

numpy.ndarray

In [23]:
df['col1'].max()

50

In [26]:
df['col1'] = df['col1']/10
df

   col1  col2  col3  col4
0   0.0     1     2     3
1   1.0    11    12    13
2   2.0    21    22    23
3   3.0    31    32    33
4   4.0    41    42    43
5   5.0    51    52    53

In [28]:
df.index.values

array([0, 1, 2, 3, 4, 5], dtype=int64)

In [30]:
df.columns[1]

'col2'

In [31]:
for item in df.columns:
    print(item)

col1
col2
col3
col4

In [32]:
df

   col1  col2  col3  col4
0   0.0     1     2     3
1   1.0    11    12    13
2   2.0    21    22    23
3   3.0    31    32    33
4   4.0    41    42    43
5   5.0    51    52    53

In [33]:
df1 = df

In [34]:
df1['col1'][0] = 100
df1

C:\Users\ADMINI~1\AppData\Local\Temp/ipykernel_21112/1894265614.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1['col1'][0] = 100

    col1  col2  col3  col4
0  100.0     1     2     3
1    1.0    11    12    13
2    2.0    21    22    23
3    3.0    31    32    33
4    4.0    41    42    43
5    5.0    51    52    53

In [35]:
df

    col1  col2  col3  col4
0  100.0     1     2     3
1    1.0    11    12    13
2    2.0    21    22    23
3    3.0    31    32    33
4    4.0    41    42    43
5    5.0    51    52    53

In [38]:
df2 = df.copy()
df2

    col1  col2  col3  col4
0  100.0     1     2     3
1    1.0    11    12    13
2    2.0    21    22    23
3    3.0    31    32    33
4    4.0    41    42    43
5    5.0    51    52    53

In [39]:
df2['col1'][1] = 1000

C:\Users\ADMINI~1\AppData\Local\Temp/ipykernel_21112/981486742.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['col1'][1] = 1000

In [40]:
df

    col1  col2  col3  col4
0  100.0     1     2     3
1    1.0    11    12    13
2    2.0    21    22    23
3    3.0    31    32    33
4    4.0    41    42    43
5    5.0    51    52    53

In [45]:
f = open('out.txt', 'w', encoding='utf-8')

f.write(str(df))

188

In [46]:
df

    col1  col2  col3  col4
0  100.0     1     2     3
1    1.0    11    12    13
2    2.0    21    22    23
3    3.0    31    32    33
4    4.0    41    42    43
5    5.0    51    52    53

In [47]:
import numpy as np
np.savetxt(r'tmp.txt', df)

In [54]:
st = print(df)
st
print(type(st))

    col1  col2  col3  col4
0  100.0     1     2     3
1    1.0    11    12    13
2    2.0    21    22    23
3    3.0    31    32    33
4    4.0    41    42    43
5    5.0    51    52    53
<class 'NoneType'>

In [53]:
f = open('out1.txt', 'w', encoding='utf-8')
f.write(st)

TypeError: write() argument must be str, not None